{"Intro":"Love Island is my favorite show. There. I said it. If you are in the same boat as me – at the edge of your seat for the next  recoupling – then I’m sure you’ve also wondered what it takes for a couple to make it to that final firepit. What about that  couple has resonated with the public voters that determine who stays and who goes. And what does that reveal about us, the viewers, and what we hope to see in a love story?","Intro2":"Love Island has become an international sensation, with the show expanding to over 12 countries and over 32 seasons.  With all this new data on singles, bombs, couples and dumpings, I’ve set to find out if there is anything I am learning from hours of mindless television.","Intro3":"For those of you new to the Love Island universe, the setup is pretty simple.  Sexy singles are marooned in a tropical villa, with coupling up being the only way to stay and win the prize money at the end.  A series of decisions made by the islanders and multiple live public votes decide who will make it through and who will be dumped from the island.","TA1a":{"plain":"Before our couples are formed, they are two individuals coming into a villa.  And while forced proximity seems to be a feature of Love Island itself, it appears to also be working for the love island audience. The longer we know these individuals the more likely we are to root for them at the end.","tagline":"","plain2":""},"TA1b":{"plain":"The earlier a single enters the villa is a large determinant of their status at the end.","tagline":"If you aren't in the villa by Day 9 your chances of winning are slim.","plain2":"75% of winners are in the villa by day 5 and 85% of winners have entered by day 9."},"TA2a":{"plain":"The second thing we can learn about our expectations as an audience is that we believe in love at first sight. We love to see an instant connection.","tagline":"","plain2":""},"TA2b":{"plain":"And in the data we can see that.  Even if couples do not stay together the entire time, 70% of winning couples have chosen each other","tagline":"by the second recoupling.","plain2":""},"TA3a":{"plain":"But what is a love story without some drama, and maybe even a love triangle.  This is reality tv we are watching, and the audience has not forgotten. Winners are more likely than the other islanders to couple up with more than just one person.","tagline":"","plain2":""},"TA3b":{"plain":"About half of our winning couples got together and","tagline":"stayed together.","plain2":"But that leaves the other half, coupling up with 2, 3, 4, 5 and even 6 different partners!"},"TA4a":{"plain":"But in the end, this is a story about commitment (who would have guessed)!  Because deep down, behind all those rock hard abs and make out challenges, we all are just looking for someone to pick us over and over again.","tagline":"","plain2":""},"TA4b":{"plain":"Winning couples are much more likely to","tagline":"choose each other multiple times.","plain2":"Even if that means recoupling after a break.  <chart showing this>"},"TA5a":{"plain":"And once they are coupled, winning couples need to spend time together. Because the audience knows that real love can’t happen without all of the mundane time sitting around a pool in a string bikini.","tagline":"","plain2":""},"TA5b":{"plain":"","tagline":"Every single winning couple was together for over 7 days.","plain2":"If a couple is together more than 14 days, their possibility of winning rises to xx%"},"TA6a":{"plain":"And there we have it - our winners!","tagline":"But Wait","plain2":"Are you seeing blue? A blue arc indicates that the winners of this season went against the model."},"Multiples":"Across the 26 seasons I was able to analyze we can see many of these tropes play out.  Though there are seasons where the predictive factors can not call the winner,  perhaps these might be the most interesting seasons to add to your queue!","Outro1":"When it comes to love, the romantic story of love and loss plays out even in our modern reality tv.  We romanticize  couples that have challenges, couples that break up and get back together, couples that have to work for love and  are committed to the process.","Outro2":"And maybe that is the largest lesson of all, that love doesn’t come easy to anyone. Love is work, even on Love Island."}