{"List":"I had to walk fifteen miles to school in the snow! Barefoot! Uphill! Both ways! ?television was called books?my mom sent me to the store with a quarter and I came back with a loaf of bread, a bottle of milk, and a newspaper. ?we didn't have hair dryers. If you wanted to blow dry your hair you stood outside during a hurricane. ?we did all our coding in 1's and in 0's, and sometimes we ran out of 1's!  ?the Internet had only four pages.","Intro1":"When my husband and I purchased our first house I couldn’t tell you the number of times family members commented on the type, the size, or the price of the house comparing it to the first house that they purchased.","Intro2":"No matter our personal considerations, we knew that any sentence that started with ‘when I was your age’ was going to come with some unsaid musing on how easy life is now and how hard life was then.","Intro3":"Nowadays, we hear those of different generations decry the laziness, the entitlement, and the narcissism of the next generation. It is a phenomenon that also happened to our parents and to our grandparents.","Intro4":"But what was it really like back then?  When did people move out of their parents house?  How difficult was it to buy a house?  What was the price of milk?  What did people spend on their education?","Intro5":"To answer all those questions we’ve analyzed historical consumer expenditure surveys, nationwide household surveys conducted by the U.S. Bureau of Labor Statistics, to identify once and for all what each generation actually gets to complain about.","Intro6":"The surveys, taken since 1888, track the share of household income and expenses for 12 main categories.","Scrolly":{"Scroll1":"Starting with the year I bought my house, 2019, we can look at the percentage of total expense that was spent on each category. For the average American, out of 100% of income, housing is the largest expense currently, followed by transportation and insurance.","Scroll2":"Expanding this to show the data from 1900 - 2021, we can see how these expenses have changed over time.","Scroll3":"There are some clear patterns we can see just by looking at this data. The average American spent a much larger percentage of their income on food and apparel in 1900.  While transportation and housing have taken up an increasing amount of household budget since then.","Scroll4":"But how can we compare these expenses across generations? “When I was your age” implies that we know your age and the age of the person musing.","Scroll5":"Let’s look at housing’s share of income.  It started this century at a little under XX% of income.  But we can see currently it now takes up xx% of income.  Now let’s add in the generations.","Scroll6":"Starting with the US median age of 38, I’ve partitioned the chart by generation, highlighting the years in which that generation was also 38.  The chart is adjustable should you want to personalize the experience to your age from here on out.","Scroll7":"Adding in the remaining categories, we can now see which expense was took up the largest amount of income for each generation. But this method can only take us so far, as some expense categories – housing for example – are expected to take up more share of our income no matter when you were born.  What we need is a way to show WHEN each category took up the largest share of income.","Scroll8":"One approach is to look at the average value for each category over time and compare how far away each generations’ expenses are from that median value.","Scroll9":"The values above the median for each time period are the expense categories that were the most burdensome relative to the other generations. The further they are from the center circle, the more burdensome they were for that time period.","Scroll10":"But this method can only show that a category was relatively more expensive, not the actual economic burden that category creates. To do that, we can calculate the % of income that is tied up in these top burdens.","Scroll11":"The largest values here are the categories that are statistically more burdensome AND have the largest economic cost for each generation.  These are the items that can officially be complained about!"},"Outro1":"Now I’m sure there are plenty of other things outside of economics that can be relayed ‘when I was your age’ style. And there is no denying that quality of life on a variety of measures has increased every generation.","Outro2":"But now, officially, you know what you (and your musing family members) can complain about!"}